SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';


CREATE TABLE stations (
    id INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    line VARCHAR(255) NOT NULL,
)

CREATE TABLE metro_lines (
    id INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    color VARCHAR(20) NOT NULL
)

INSERT INTO metro_lines(id, name, color) VALUES
(1, 'Холодногірсько-Заводська' , 'Червоний'),
(2, 'Салтівська' , 'Синій'),
(3, 'Олексіївська' , 'Зелений')

INSERT INTO stations(id, name, line) VALUES
(1, 'Холодна гора' , 'Холодногірсько-Заводська'),
(2, 'Південний вокзал' , 'Холодногірсько-Заводська'),
(3, 'Центральний ринок' , 'Холодногірсько-Заводська'),
(4, 'Майдан Конституції' , 'Холодногірсько-Заводська'),
(5, 'Проспект Гагаріна' , 'Холодногірсько-Заводська'),
(6, 'Спортивна' , 'Холодногірсько-Заводська'),
(7, 'Турбоатом' , 'Холодногірсько-Заводська'),
(8, 'Дворець спорта' , 'Холодногірсько-Заводська'),
(9, 'Армійська' , 'Холодногірсько-Заводська'),
(10, 'Тракторний завод' , 'Холодногірсько-Заводська'),
(11, 'Індустріальна' , 'Холодногірсько-Заводська'),
(12, 'Історичний музей' , 'Салтівська'),
(13, 'Університет' , 'Салтівська'),
(14, 'Пушкінська' , 'Салтівська'),
(15, 'Київська' , 'Салтівська'),
(16, 'Академіка Барабашова' , 'Салтівська'),
(17, 'Академіка Павлова' , 'Салтівська'),
(18, 'Студентська' , 'Салтівська'),
(19, 'Героїв Праці' , 'Салтівська'),
(20, 'Метробудівників' , 'Олексіївська'),
(21, 'Захисників України' , 'Олексіївська'),
(22, 'Архітектора Бекетова' , 'Олексіївська'),
(23, 'Держпром' , 'Олексіївська'),
(24, 'Наукова' , 'Олексіївська'),
(25, 'Ботанічний сад' , 'Олексіївська'),
(26, '23 Серпня' , 'Олексіївська'),
(27, 'Олексіївська' , 'Олексіївська'),
(28, 'Перемога' , 'Олексіївська')